package languages_test

import (
	"testing"
)

var hytests = []SegmentationTest{
	{
		text: "Ի՞նչ ես մտածում: Ոչինչ:",
		sentences: []string{
			"Ի՞նչ ես մտածում:",
			"Ոչինչ:",
		},
	},
	{
		text: "Ապրիլի 24-ին սկսեց անձրևել...Այդպես էի գիտեի:",
		sentences: []string{
			"Ապրիլի 24-ին սկսեց անձրևել...Այդպես էի գիտեի:",
		},
	},
	{
		text: "Այսպիսով` մոտենում ենք ավարտին: Տրամաբանությյունը հետևյալն է. պարզություն և աշխատանք:",
		sentences: []string{
			"Այսպիսով` մոտենում ենք ավարտին:",
			"Տրամաբանությյունը հետևյալն է. պարզություն և աշխատանք:",
		},
	},
	{
		text: "Սա այն փուլն է, երբ տեղի է ունենում Համակարգի մշակումը: Համաձայն Փուլ 2-ի, Մատակարարը մշակում և/կամ հարմարեցնում է համապատասխան ծրագիրը, տեղադրում ծրագրի բաղկացուցիչները, կատարում առանձին բլոկի և համակարգի թեստավորում և ներառում տարբեր մոդուլներ եզակի աշխատանքային համակարգում, որը կազմում է այս Փուլի արդյունքը:",
		sentences: []string{
			"Սա այն փուլն է, երբ տեղի է ունենում Համակարգի մշակումը:",
			"Համաձայն Փուլ 2-ի, Մատակարարը մշակում և/կամ հարմարեցնում է համապատասխան ծրագիրը, տեղադրում ծրագրի բաղկացուցիչները, կատարում առանձին բլոկի և համակարգի թեստավորում և ներառում տարբեր մոդուլներ եզակի աշխատանքային համակարգում, որը կազմում է այս Փուլի արդյունքը:",
		},
	},
	{
		text: "Մատակարարի նախագծի անձնակազմի կողմից համակարգի թեստերը հաջող անցնելուց հետո, Համակարգը տրվում է Գնորդին թեստավորման համար: 2-րդ փուլում, հիմք ընդունելով թեստային սցենարիոները, թեստերը կատարվում են Կառավարության կողմից Մատակարարի աջակցությամբ: Այս թեստերի թիրախը հանդիսանում է Համակարգի` որպես մեկ ամբողջության և համակարգի գործունեության ստուգումը համաձայն տեխնիկական բնութագրերի: Այս թեստերի հաջողակ ավարտից հետո, Համակարգը ժամանակավոր ընդունվում է Կառավարության կողմից: Այս թեստերի արդյունքները փաստաթղթային ձևով կներակայացվեն Թեստային Արդյունքների Հաշվետվություններում: Մատակարարը պետք է տրամադրի հետևյալը`",
		sentences: []string{
			"Մատակարարի նախագծի անձնակազմի կողմից համակարգի թեստերը հաջող անցնելուց հետո, Համակարգը տրվում է Գնորդին թեստավորման համար:",
			"2-րդ փուլում, հիմք ընդունելով թեստային սցենարիոները, թեստերը կատարվում են Կառավարության կողմից Մատակարարի աջակցությամբ:",
			"Այս թեստերի թիրախը հանդիսանում է Համակարգի` որպես մեկ ամբողջության և համակարգի գործունեության ստուգումը համաձայն տեխնիկական բնութագրերի:",
			"Այս թեստերի հաջողակ ավարտից հետո, Համակարգը ժամանակավոր ընդունվում է Կառավարության կողմից:",
			"Այս թեստերի արդյունքները փաստաթղթային ձևով կներակայացվեն Թեստային Արդյունքների Հաշվետվություններում:",
			"Մատակարարը պետք է տրամադրի հետևյալը`",
		},
	},
	{
		text: "Բարև Ձեզ: Իմ անունն էԱրմինե:",
		sentences: []string{
			"Բարև Ձեզ:",
			"Իմ անունն էԱրմինե:",
		},
	},
	{
		text: "Այսօր երկուշաբթի է: Ես գնում եմ աշխատանքի:",
		sentences: []string{
			"Այսօր երկուշաբթի է:",
			"Ես գնում եմ աշխատանքի:",
		},
	},
	{
		text: "Վաղը սեպտեմբերի 1-ն է: Մենք գնում ենք դպրոց:",
		sentences: []string{
			"Վաղը սեպտեմբերի 1-ն է:",
			"Մենք գնում ենք դպրոց:",
		},
	},
	{
		text: "Այո, ես հասկացա: Ես իսկապես քեզ սիրում եմ:",
		sentences: []string{
			"Այո, ես հասկացա:",
			"Ես իսկապես քեզ սիրում եմ:",
		},
	},
	{
		text: "Փակիր պատուհանները: Երեկոյան անձրևում է:",
		sentences: []string{
			"Փակիր պատուհանները:",
			"Երեկոյան անձրևում է:",
		},
	},
	{
		text: "Մութ է: Ես պետք է տուն վերադառնամ:",
		sentences: []string{
			"Մութ է:",
			"Ես պետք է տուն վերադառնամ:",
		},
	},
	{
		text: "Գիտես, սկսել եմ հավատալ: Ամեն ինչ փոխվում է:",
		sentences: []string{
			"Գիտես, սկսել եմ հավատալ:",
			"Ամեն ինչ փոխվում է:",
		},
	},
	{
		text: "Տոնածառը նոր է: Պետք է այն զարդարել:",
		sentences: []string{
			"Տոնածառը նոր է:",
			"Պետք է այն զարդարել:",
		},
	},
	{
		text: "Ես շտապում եմ: Ես քեզ չեմ կարող սպասել:",
		sentences: []string{
			"Ես շտապում եմ:",
			"Ես քեզ չեմ կարող սպասել:",
		},
	},
	{
		text: "Սպասիր, մենք իրար սիրում ենք: Ցանկանում եմ միասին ապրենք:",
		sentences: []string{
			"Սպասիր, մենք իրար սիրում ենք:",
			"Ցանկանում եմ միասին ապրենք:",
		},
	},
	{
		text: "Ոչ, այդպես չեմ կարծում: Դա ճիշտ չէ:",
		sentences: []string{
			"Ոչ, այդպես չեմ կարծում:",
			"Դա ճիշտ չէ:",
		},
	},
	{
		text: "Ապրիլի 24-ին սկսեց անձրևել...Այդպես էի գիտեի:",
		sentences: []string{
			"Ապրիլի 24-ին սկսեց անձրևել...Այդպես էի գիտեի:",
		},
	},
	{
		text: "1960 թվական…ձմեռ…գիշեր: Սառն էր…դատարկություն:",
		sentences: []string{
			"1960 թվական…ձմեռ…գիշեր:",
			"Սառն էր…դատարկություն:",
		},
	},
	{
		text: "Ինչ՟ու այն, ինչ անում է մարդը, չի կարող անել համակարգիչը: Պարզապես չունի մարդկային ուղեղ:",
		sentences: []string{
			"Ինչ՟ու այն, ինչ անում է մարդը, չի կարող անել համակարգիչը:",
			"Պարզապես չունի մարդկային ուղեղ:",
		},
	},
	{
		text: "Թվարկիր ինձ համար 3 բան, որ կարևոր է քեզ համար - Պատասխանում եմ. սեր, գիտելիք, ազնվություն:",
		sentences: []string{
			"Թվարկիր ինձ համար 3 բան, որ կարևոր է քեզ համար - Պատասխանում եմ. սեր, գիտելիք, ազնվություն:",
		},
	},
	{
		text: "Այսպիսով` մոտենում ենք ավարտին: Տրամաբանությյունը հետևյալն է. պարզություն և աշխատանք:",
		sentences: []string{
			"Այսպիսով` մոտենում ենք ավարտին:",
			"Տրամաբանությյունը հետևյալն է. պարզություն և աշխատանք:",
		},
	},
	{
		text: "Ի՞նչ ես մտածում: Ոչինչ:",
		sentences: []string{
			"Ի՞նչ ես մտածում:",
			"Ոչինչ:",
		},
	},
	{
		text: "Կարող ե՞նք միասին աշխատել: Գուցե այն ինչ մտածում ես, իրականանալի է:",
		sentences: []string{
			"Կարող ե՞նք միասին աշխատել:",
			"Գուցե այն ինչ մտածում ես, իրականանալի է:",
		},
	},
	{
		text: "Հիմա, այն ինչ սկսել ենք, ավարտին է մոտենում: Հարցերը սակայն շատ են...:",
		sentences: []string{
			"Հիմա, այն ինչ սկսել ենք, ավարտին է մոտենում:",
			"Հարցերը սակայն շատ են...:",
		},
	},
	{
		text: "Սիրելիս...սպասում եմ: Գնամ թ՟ե …:",
		sentences: []string{
			"Սիրելիս...սպասում եմ:",
			"Գնամ թ՟ե …:",
		},
	},
	{
		text: "Դիեգո Արմանդո Մարադոնան ծնվել է 1960 թվականի հոկտեմբերի 30-ին (կիրակի)` առավոտյան ժամը 5-ին, Բուենոս-Այրես գավառում գտնվող Լանուս քաղաքի Էվիտա կլինիկայում: Նա ծնվել է Դոն Դիեգոյի ընտանիքում: Հայրն աշխատում էր Տրիտումոլ հողմաղացում որպես բանվոր, իսկ մայրը` Դալմա Սալվադորա Ֆրանկոն, տնային տնտեսուհի էր։ Դիեգոն ընտանիքի հինգերորդ, բայց առաջին արու զավակն էր, ուներ չորս քույր` Ռիտան, Աննան, Էլզան և Մարիան։ Դալմա Սալվադորան ասում էր. «Նա բոլորովին չչարչարեց ինձ. շաբաթ ամբողջ օրը ես ինձ շատ լավ էի զգում, իսկ գիշերն ինձ կլինիկա տարան: Նա շատ արագ լույս աշխարհ եկավ: Այդ պահին ես միայն մի բան էի խնդրում. որպեսզի նա առողջ ծնվի և լավ մարդ դառնա: Բարեբախտաբար, այդ ամենն իրականացավ, կարծում եմ, դեռ մի բան էլ ավելի»։",
		sentences: []string{
			"Դիեգո Արմանդո Մարադոնան ծնվել է 1960 թվականի հոկտեմբերի 30-ին (կիրակի)` առավոտյան ժամը 5-ին, Բուենոս-Այրես գավառում գտնվող Լանուս քաղաքի Էվիտա կլինիկայում:",
			"Նա ծնվել է Դոն Դիեգոյի ընտանիքում:",
			"Հայրն աշխատում էր Տրիտումոլ հողմաղացում որպես բանվոր, իսկ մայրը` Դալմա Սալվադորա Ֆրանկոն, տնային տնտեսուհի էր։",
			"Դիեգոն ընտանիքի հինգերորդ, բայց առաջին արու զավակն էր, ուներ չորս քույր` Ռիտան, Աննան, Էլզան և Մարիան։",
			"Դալմա Սալվադորան ասում էր. «Նա բոլորովին չչարչարեց ինձ. շաբաթ ամբողջ օրը ես ինձ շատ լավ էի զգում, իսկ գիշերն ինձ կլինիկա տարան: Նա շատ արագ լույս աշխարհ եկավ: Այդ պահին ես միայն մի բան էի խնդրում. որպեսզի նա առողջ ծնվի և լավ մարդ դառնա: Բարեբախտաբար, այդ ամենն իրականացավ, կարծում եմ, դեռ մի բան էլ ավելի»։",
		},
	},
}

func TestArmenian(t *testing.T) {
	LanguageTest(t, "hy", hytests)
}
