package languages_test

import (
	"testing"
)

var gutests = []SegmentationTest{

	{
		text: "પણ બીજાનાં સ્વપ્નાં જોવા રહું તો મારાં સ્વપ્નાંમાંનો વખત જ ન રહે ને! અને આવાં સ્વપ્નાં તો હરકોઈ જોઈ શકે છે. દાખલા તરીકે આ સ્વપ્નું તમે જોઈ શકશો ને મને કહી શકશો, પણ મારાં સ્વપ્નાં તો મારા વિના બીજું કોઈ જોઈ શકવાનું નથી!",
		sentences: []string{
			"પણ બીજાનાં સ્વપ્નાં જોવા રહું તો મારાં સ્વપ્નાંમાંનો વખત જ ન રહે ને!",
			"અને આવાં સ્વપ્નાં તો હરકોઈ જોઈ શકે છે.",
			"દાખલા તરીકે આ સ્વપ્નું તમે જોઈ શકશો ને મને કહી શકશો, પણ મારાં સ્વપ્નાં તો મારા વિના બીજું કોઈ જોઈ શકવાનું નથી!",
		},
	},
}

func TestGujarati(t *testing.T) {
	LanguageTest(t, "gu", gutests)
}
