package languages_test

import (
	"testing"
)

var mrtests = []SegmentationTest{
	{
		text: "પણ બીજાનાં સ્વપ્નાં જોવા રહું તો મારાં સ્વપ્નાંમાંનો વખત જ ન રહે ને! અને આવાં સ્વપ્નાં તો હરકોઈ જોઈ શકે છે. દાખલા તરીકે આ સ્વપ્નું તમે જોઈ શકશો ને મને કહી શકશો, પણ મારાં સ્વપ્નાં તો મારા વિના બીજું કોઈ જોઈ શકવાનું નથી!",
		sentences: []string{
			"પણ બીજાનાં સ્વપ્નાં જોવા રહું તો મારાં સ્વપ્નાંમાંનો વખત જ ન રહે ને!",
			"અને આવાં સ્વપ્નાં તો હરકોઈ જોઈ શકે છે.",
			"દાખલા તરીકે આ સ્વપ્નું તમે જોઈ શકશો ને મને કહી શકશો, પણ મારાં સ્વપ્નાં તો મારા વિના બીજું કોઈ જોઈ શકવાનું નથી!",
		},
	},
	{
		text: "आज दसरा आहे. आज खूप शुभ दिवस आहे.",
		sentences: []string{
			"आज दसरा आहे.",
			"आज खूप शुभ दिवस आहे.",
		},
	},
	{
		text: "ढग खूप गर्जत होते; पण पाऊस पडत नव्हता.",
		sentences: []string{
			"ढग खूप गर्जत होते; पण पाऊस पडत नव्हता.",
		},
	},
	{
		text: "रमाची परीक्षा कधी आहे? अवकाश आहे अजून.",
		sentences: []string{
			"रमाची परीक्षा कधी आहे?",
			"अवकाश आहे अजून.",
		},
	},
	{
		text: "शाब्बास, असाच अभ्यास कर! आणि मग तुला नक्की यश मिळणार.",
		sentences: []string{
			"शाब्बास, असाच अभ्यास कर!",
			"आणि मग तुला नक्की यश मिळणार.",
		},
	},
	{
		text: "\"आपली आपण करी स्तुती तो एक मूर्ख\" असे समर्थ रामदासस्वामी म्हणतात.",
		sentences: []string{
			"\"आपली आपण करी स्तुती तो एक मूर्ख\" असे समर्थ रामदासस्वामी म्हणतात.",
		},
	},
}

func TestMarathi(t *testing.T) {
	LanguageTest(t, "mr", mrtests)
}
